#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/renata-corporation/learning-aws-lambda-with-serverless/runs/run-xV5gYo3HMwbkjAw8

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_resource.MyDemoResource will be created
  + resource "aws_api_gateway_resource" "MyDemoResource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "mydemoresource"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.MyDemoAPI will be created
  + resource "aws_api_gateway_rest_api" "MyDemoAPI" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "This is my API for demonstration purposes"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "MyDemoAPI"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @renatabrasil, Action: `pull_request`*